/* Text for close button */
"Close" = "Închidere";

/* Text for button to scan a credit card */
"Scan Card" = "Scanare card";

/* Button title to open camera to scan credit/debit card */
"Scan card" = "Scanare card";

/* An error message displayed when the customer's iban is invalid. */
"The IBAN you entered is invalid." = "Codul IBAN pe care l-ați introdus nu este valid.";

/* Error when there is a problem processing the credit card */
"There was an error processing your card -- try again in a few seconds" = "A apărut o eroare la procesarea cardului dvs. -- încercați din nou în câteva secunde";

/* Unexpected error, such as a 500 from Stripe or a JSON parse error */
"There was an unexpected error -- try again in a few seconds" = "A apărut o eroare neașteptată -- încercați din nou în câteva secunde";

/* Button to reload web view if we were unable to connect. */
"Try again" = "Încercați din nou";

/* Error when the card has already expired */
"Your card has expired" = "Cardul dvs. a expirat";

/* Error when the card was declined by the credit card networks */
"Your card was declined" = "Cardul dvs. a fost respins";

/* Error when the card&apos;s expiration month is not valid */
"Your card's expiration month is invalid" = "Luna de expirare a cardului dvs. nu este validă";

/* Error when the card&apos;s expiration year is not valid */
"Your card's expiration year is invalid" = "Anul de expirare al cardului dvs. nu este valid";

/* Error when the card number is not valid */
"Your card's number is invalid" = "Numărul cardului dvs. nu este valid";

/* Error when the card&apos;s CVC is not valid */
"Your card's security code is invalid" = "Codul de securitate al cardului dvs. nu este valid";

/* Error when customer's name is invalid */
"Your name is invalid." = "Numele dvs. nu este valid.";

